# ==========================================================
# Homebrew Brewfile
# Categorized with comments so it's easy to scan & tweak.
# Tip: comment out lines you don't want before first run.
# ==========================================================

# ----- Package repositories (taps) -----
brew "homebrew/cask-fonts"

# ----- Core CLI & utilities (terminal tools you’ll use everywhere) -----
brew "git"           # version control
brew "gh"            # GitHub CLI
brew "jq"            # JSON processor
brew "ripgrep"       # fast grep alternative (rg)
brew "fd"            # faster find
brew "eza"           # modern ls
brew "bat"           # cat with syntax highlighting
brew "fzf"           # fuzzy finder
brew "zoxide"        # smarter cd
brew "tree"          # directory tree view
brew "wget"          # downloader
brew "httpie"        # friendly HTTP client
brew "tldr"          # simplified man pages
brew "git-delta"     # gorgeous git diffs

# ----- Language runtimes & managers -----
brew "python@3.12"   # Python runtime
brew "pipx"          # install Python CLIs in isolated envs
brew "uv"            # Python package & venv manager (fast)
brew "fnm"           # fast Node version manager
brew "pnpm"          # preferred JS package manager

# ----- Databases -----
brew "postgresql@16" # Postgres database server (started via brew services)

# ----- Dock management helper -----
brew "hpedrorodrigues/tools/dockutil" # reliable Dock add/remove/move

# ----- GUI Apps: Browsers -----
cask "google-chrome"   # primary browser
cask "arc"              # secondary browser (Chromium‑based)

# ----- GUI Apps: IDEs & Dev Utilities -----
cask "visual-studio-code" # code editor
cask "warp"               # modern terminal
cask "docker"             # Docker Desktop (GUI + engine)
cask "cursor"            # Cursor AI IDE (VS Code‑based)
cask "kiro"              # Kiro agent‑centric AI IDE

# ----- GUI Apps: Data & DB -----
cask "dbeaver-community"  # multi‑DB client

# ----- GUI Apps: Productivity & Files -----
cask "notion"             # notes/PM
cask "microsoft-excel"    # Excel
cask "microsoft-word"     # Word
cask "microsoft-powerpoint" # PowerPoint
cask "onedrive"           # OneDrive sync client
cask "notion-calendar"    # Notion Calendar (formerly Cron)
cask "github"             # GitHub Desktop
cask "chrome-remote-desktop-host" # Chrome Remote Desktop host
cask "raspberry-pi-imager" # Raspberry Pi SD card imager

# ----- GUI Apps: Communication & Media -----
cask "telegram"           # Telegram messenger
cask "whatsapp"           # WhatsApp desktop client
cask "discord"            # chat/voice
cask "spotify"            # music

# ----- GUI Apps: System Utilities (quality of life) -----
cask "raycast"            # launcher
cask "rectangle"          # window manager
cask "monitorcontrol"     # external monitor brightness/volume
cask "hiddenbar"          # hide menu bar items
cask "stats"              # system monitors in menu bar

# ----- Fonts -----
cask "font-jetbrains-mono-nerd-font" # dev‑friendly font
